---
kind: property
id: P:Autodesk.Revit.DB.Macros.MacroModule.ModuleStatus
source: html/b207020a-8f53-71b1-6471-55c41e6066a2.htm
---
# Autodesk.Revit.DB.Macros.MacroModule.ModuleStatus Property

The module status.

## Syntax (C#)
```csharp
public ModuleStatus ModuleStatus { get; }
```